import { CrosswordConfig } from '../types/crossword';

const puzzle: CrosswordConfig = {
  name: "2025-03-03",
  grid: [
    ["מ", "ש", "פ", "ח", "ה"],
    ["פ", "ע", "ל", "ו", "ל"],
    ["ל", "ט", "ב", "ו", "ל"],
    ["ג", "נ", "ל", "י", "blank"],
    ["ה", "ז", "י", "ה", "blank"]
  ],
  rowClues: [
    "אותה לא בוחרים",
    "בשביל זה יש כפילים",
    "כשהמים קרים מדי בשביל לשחות, זה מה שנשאר",
    "שם אפשרי לפעוטון של בירן",
    "״כל כך מופרך״"
  ],
  "columnClues": [
    "אותה כן בוחרים",
    "ערבוב של צמר ופשתן",
    "תעשי את זה עם העיניים כדי לבלבל אותו",
    "כל אירוע שמכבד את עצמו, בזמן האחרון",
    "תעשו את זה בשביל יה, כמו בשיר",
  ],
};

export default puzzle; 