import { CrosswordConfig } from "../types/crossword";

const words = [
  ["ל", "ב", "נ", "ר", "ק"],
  ["ה", "כ", "י", "ב", "ר"],
  ["ד", "ו", "ג", "י", "נ"],
  ["ה", "פ", "ו", "צ", "פ"],
  ["ד", "ה", "ד", "ה", "blank"],
];

const fixedWords = words.map(word => word.reverse());

export const puzzle11: CrosswordConfig = {
  name: "2025-05-15",
  "grid": fixedWords,
  "rowClues": [
    "עדנה שהיא ממקורות ה״ברזל״ של טלי גוטליב",
    "מרכיב חשוב ברוטב סמיך",
    "ביחד עם 3 מאונך: יום, למשל",
    "דיברו",
    "חזר אחרי",
  ],
  "columnClues": [
    "אולי קצת יותר מדי הולך עם הזרם",
    "הכורסא נקראת על שם מה שעושים איתה",
    "ביחד עם 3 מאוזן: לילה, למשל",
    "ידיעה נפוצה בבית לוויה",
    "לעשות כמו 5 מאוזן",
  ]
}; 