import { CrosswordConfig } from "../types/crossword";

const words = [
  ["ה", "י", "ס", "נ", "פ"],
  ["נ", "ו", "ל", "י", "ו"],
  ["blank", "צ", "ב", "ש", "ת"],
  ["ה", "ר", "י", "ת", "ח"],
  ["נ", "ו", "ד", "י", "נ"],
];

const fixedWords = words.map(word => word.reverse());

const puzzle: CrosswordConfig = {
  name: "2025-05-08",
  "grid": fixedWords,
  "rowClues": [
    "כל כמה שנים מאיימים לפגוע בה, אבל בלי כלי נשק",
    "לפעמים זה כל מה שמונע מרצפת חדר האמבטיה להתמלא במים",
    "קרוב משפחה של זה עם החיצים",
    "ענף באולימפיאדה",
    "הוחלטה לגביו החלטה, אבל לא כדי להיטיב איתו",
  ],
  "columnClues": [
    "סוג של one trick pony במטבח",
    "שם תואר לא מחמיא ל-4 מאוזן, כענף",
    "יוצאים איתו אחרי ביקור מוצלח בחנות",
    "לפי הביטוי האנגלי, מי שמסתכן עלול לפגוש אותו",
    "ביחד: הסכים בשתיקה",
  ]
}; 

export default puzzle; 