import { CrosswordConfig } from "../types/crossword";

const words = [
    ["blank", "ר", "ו", "ב", "blank"],
    ["נ", "א", "י", "ל", "מ"],
    ["ו", "ש", "ר", "י", "פ"],
    ["ל", "ו", "ע", "ב", "ט"],
    ["blank", "נ", "ה", "כ", "blank"],
    ]
    
    const fixedWords = words.map(word => word.reverse());
    
    export const puzzle8: CrosswordConfig = {
      name: "2025-04-10",
      "grid": fixedWords,
      "rowClues": [
        "יכול להיות בתקציב או באדמה",
        "מסודר כלכלית (סלנג)",
        "קראו בין השורות",
        "זה לא בשר, זה:",
        "אחים מפורסמים מהוליווד",
      ],
      "columnClues": [
        "חבובה (לעז)",
        "איפה ייתכן שיש לך שמש, לפי השיר?",
        "״יבוא _____ בעמי״ (מי שהוא יודע לרעות הצאן איש לפי כוחו)",
        "לשכנים שלה היה אפשר לקרוא ״באר״, ״נס״ ו-״כפר״",
        "שם מחמיא לקרטון שמתוחים עליו חוטים",
      ]
    }; 