import { CrosswordConfig } from '../types/crossword';

const puzzle: CrosswordConfig = {
  name: "2025-03-06",
  "grid": [
    ["ח", "ת", "ו", "נ", "ה"],
    ["י", "ש", "ו", "י", "ש"],
    ["ת", "מ", "נ", "ו", "נ"],
    ["ו", "י", "ל", "ב", "י"],
    ["ל", "צ", "ה", "י", "ה"]
  ],
  "rowClues": [
    "מקובל לשמור בשבילה תאריך",
    "תשובה משמחת לשני בירורים לגבי המלאי",
    "כינוי לשוער וירטואוזי",
    "דוברי ספרדית עושים את ההמרה הזאת לפעמים",
    "הספד לאדם משעשע"
  ],
  "columnClues": [
    "זמן מה אחרי 1 מאוזן, הרבה מוצאים את עצמם מחליפים אותו",
    "תפתח עליו פה",
    "יש לה יכולת לרכוש פריט זול מאוד בדרום קוריאה",
    "״זה פעם ראשונה שלו״",
    "תשובה אפשרית להתלבטות בין שתי אפשרויות"
  ]
};

export default puzzle; 