import { CrosswordConfig } from '../types/crossword';

export const puzzle3: CrosswordConfig = {
  name: "2025-03-07",
  "grid": [
    [
      "blank",
      "blank",
      "ח",
      "ס",
      "ר"
    ],
    [
      "blank",
      "ר",
      "ט",
      "י",
      "ו"
    ],
    [
      "א",
      "י",
      "מ",
      "א",
      "מ"
    ],
    [
      "ח",
      "צ",
      "י",
      "ו",
      "נ"
    ],
    [
      "מ",
      "ה",
      "ת",
      "ל",
      "ה"
    ]
  ],
  "rowClues": [
    "סוג הכתיב במילה ספר, אולי",
    "ב-X: תגובה שהיא פופולארית יותר מהדבר שהיא מגיבה עליו",
    "מנהיג מוסלמי",
    "לפעמים הוא יותר מעניין מהממוצע",
    "וואלאס עשה אחת אינסופית"
  ],
  "columnClues": [
    "דמות בעלת משקל (רת)",
    "דרך להגיע מהר גם כשאין דלק",
    "פרח עם חלק אמצעי בולט",
    "בירה מזרחית",
    "א-לה ___ (תיאור של מאכל איטלקי)"
  ]
}; 