import { CrosswordConfig } from "../types/crossword";

const words = [
    ["ל", "י", "ש", "כ", "מ"],
    ["ח", "י", "ל", "צ", "י"],
    ["ו", "ד", "ח", "ס", "ש"],
    ["ו", "י", "ל", "ע", "מ"],
    ["ה", "ש", "י", "ר", "כ"],
    ]
    
    const fixedWords = words.map(word => word.reverse());
    
    export const puzzle11: CrosswordConfig = {
      name: "2025-05-01",
      "grid": fixedWords,
      "rowClues": [
        "מה שהמרצה עושה כשהתלמיד לא עומד בציפיות",
        "ילך לו טוב",
        "המפלגה הדתית הביאו קושיה",
        "מנין לצמח כל הפחמן הדו חמצני? (על פי רוב)",
        "זה לא בצל ולא דולפינה",
      ],
      "columnClues": [
        "״לא נראה לי שיש לך סמכות לקבוע״",
        "חילופי תפקידים במשרד החוץ",
        "תדאג שזה יגיע אלי",
          "שפתו של הירושלימער אלמאנאך",
          "״הביתה!״ (אמר החקלאי)",
      ]
    }; 